grouper-ws/grouper-ws/doc/xmlExamples/viewOrEditAttributesSoapRequest.xml

<?xml version='1.0' encoding='UTF-8'?>
<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope">
  <soapenv:Body>
    <ns1:viewOrEditAttributes xmlns:ns1="http://webservices.grouper.middleware.internet2.edu/xsd">
      <ns1:wsGroupLookups>
        <ns1:groupName>aStem:aGroup</ns1:groupName>
      </ns1:wsGroupLookups>
      <ns1:wsGroupLookups>
        <ns1:groupName>aStem:aGroup2</ns1:groupName>
      </ns1:wsGroupLookups>
      <ns1:wsAttributeEdits>
        <ns1:name>description</ns1:name>
        <ns1:value>some description</ns1:value>
      </ns1:wsAttributeEdits>
      <ns1:wsAttributeEdits>
        <ns1:name>description</ns1:name>
        <ns1:value>some description</ns1:value>
      </ns1:wsAttributeEdits>
      <ns1:actAsSubjectLookup>
        <ns1:subjectId>GrouperSystem</ns1:subjectId>
      </ns1:actAsSubjectLookup>
    </ns1:viewOrEditAttributes>
  </soapenv:Body>
</soapenv:Envelope>